#!/usr/bin/env python
# -*- coding: utf-8 -*-
#-----------------------------------------------------------------------------
# Σε αυτό το παράδειγμα θα δημιουργήσουμε ένα server για το localhost σε ένα καθορισμένο port,(θύρα) .
# Τα δεδομένα λαμβάνονται από τον Client, επεξεργάζονται, και επιστρέφονται πίσω στον Client.
# Εισαγωγή απαιτούμενων βιβλιοθηκών, (libraries)
#-----------------------------------------------------------------------------
# Aπαιτείται η χρήση του socket library
import socket


#-----------------------------------------------------------------------------
# Τοποθετούμε τα αναγκαία functions παρακάτω.
#-----------------------------------------------------------------------------
def process_data(d):
    # Τοποθέτηση κώδικα για όπια επεξεργασία δεδομένων εδώ.
    
    return d

    
#-----------------------------------------------------------------------------
# Το κύριο πρόγραμμα.
#-----------------------------------------------------------------------------
    
# Δημιουργούμε ένα νέο socket και καθορίζουμε ποια host και port θα ακούει. 
sock = socket.socket(socket.AF_INET, socket.SOCK_STREAM)
host = '127.0.0.1'
port = 80

# 'Δεσμεύουμε' το socket στο port(θύρα) του host, που έχουμε ήδη δηλώσει ποιο πάνω. 
# Εάν το port, είναι σε χρήση θα λάβουμε ένα μήνυμα σφάλματος.
sock.bind((host,port))

# Λέμε στο socket να αρχίσει να ακούει για συνδέσεις. Εδώ θα χειριστεί μόνο μία.
print "Listening..."
sock.listen(1)

# Βάζουμε το Server σε ένα loop όπου θα δέχεται μια σύνδεση, θα λαμβάνει δεδομένα απο τον Client,
# θα τα επεξεργάζεται, θα τα στέλνει πίσω στον Client, και θα κλείνει τη σύνδεση. Αυτή η διαδικασία θα επαναλαμβάνεται για πάντα.
while True:
    # Αποδοχή μιας σύνδεσης και λήψη δεδομένων.
    client, address = sock.accept()
    data = client.recv(1024)
    print "Received <- %s" % (data)
    
    if data:
        # Εάν γίνει λήψη δεδομένων θα τα επεξεργαστεί και θα τα στείλει πίσω.
        send = process_data(data)
        print "Sent ->: %s" % (send)
        client.send(send)
    
    # Κλείσιμο της σύνδεσης με τον Client.
    client.close()